{
  "conversas": [
    {
      "mensagens": [
        "o que você faz?",
        "como você pode me ajudar?",
        "qual sua função?",
        "para que você serve?",
        "o que você pode fazer por mim?",
        "quais são suas habilidades?",
        "quais são suas funções?",
        "quem é você?"
      ],
      "resposta": "Eu sou um chatbot assistente de receitas! Minha principal função é te ajudar a encontrar receitas que contenham os ingredientes que você me fornecer. Por exemplo, se você digitar 'frango, arroz, brócolis', eu buscarei receitas que usem esses ingredientes.\nDigite 'iniciar pesquisa' para começar!"
    },
    {
      "mensagens": [
        "você substitui um nutricionista?",
        "suas dicas são médicas?",
        "posso seguir suas receitas sem consultar um médico?"
      ],
      "resposta": "Não! Eu sou um sistema para te auxiliar com ideias de receitas e informações gerais! Lembre-se que minhas sugestões não substituem o acompanhamento e as orientações personalizadas de um nutricionista ou profissional de saúde. Sempre consulte um especialista."
    },
    {
      "mensagens": [
        "de onde vêm suas receitas?",
        "qual a fonte das suas informações?",
        "suas receitas são confiáveis?"
      ],
      "resposta": "Minhas receitas são extraídas de uma base de dados (arquivos .txt) cuidadosamente preparada, com foco em variedade de pratos."
    },
    {
      "mensagens": [
        "você tem receitas para quais dietas?",
        "quais tipos de dietas você cobre?",
        "que tipo de objetivo nutricional você ajuda?",
        "você tem receitas para dietas específicas?",
        "quais são os objetivos nutricionais das suas receitas?"
      ],
      "resposta": "Minha especialidade é encontrar receitas com base nos ingredientes que você me informa. Se você deseja seguir uma dieta específica ou tem alguma restrição alimentar, a melhor forma de usar minha busca é listar apenas os ingredientes permitidos ou desejados para essa dieta ou restrição. Eu ainda não possuo filtros pré-definidos para dietas como 'bulking', 'cutting' ou 'zero lactose', mas posso encontrar receitas que, por acaso, se alinhem com essas necessidades se você ajustar os ingredientes da sua busca. \nDigite 'iniciar pesquisa' para começar!"
    },
    {
      "mensagens": [
        "você ajuda a emagrecer?",
        "quero emagrecer",
        "quero receitas para perder peso",
        "preciso ganhar massa muscular, você ajuda?",
        "quero ganhar massa muscular?",
        "quero receitas de bulking",
        "quero receitas de cutting"
      ],
      "resposta": "Sim! Eu posso te ajudar a encontrar receitas com os ingredientes que você prefere e também a excluir aqueles que você quer evitar. Se você tem um objetivo como emagrecer ou ganhar massa muscular, você pode me fornecer uma lista de ingredientes que se alinhem com esses objetivos ou ingredientes a serem evitados, e eu buscarei receitas que se alinhem com esses objetivos.\nDigite 'iniciar pesquisa' para começar!"
    },
    {
      "mensagens": [
        "tenho alergia a amendoim, você tem receitas sem?",
        "receitas para alérgicos",
        "receitas para intolerantes à lactose",
        "sou intolerante à lactose, e agora?",
        "preciso de receitas sem glúten para o café da manhã",
        "quero receitas sem glutem",
        "Sou diabético, você tem receitas sem açúcar?"
      ],
      "resposta": "Com certeza! Tenho receitas para as mais diversas restrições, você pode me dizer explicitamente quais ingredientes evitar e eu buscarei receitas que se alinhem com esses objetivos.\nDigite 'iniciar pesquisa' para começar!"
    },
    {
      "mensagens": [
        "quais tipos de refeição você tem?",
        "você tem receitas para lanches?",
        "e sobremesas?",
        "você tem receitas para sobremesas?",
        "você tem receitas para café da manhã?",
        "Quais tipos de refeição você tem?"
      ],
      "resposta": "Minha base de dados inclui receitas que podem servir para café da manhã, almoço, jantar e lanches! A categorização exata dependerá dos ingredientes que você buscar (e dos que você excluir). Minhas receitas são focadas em refeições completas e com ingredientes que sejam saudáveis e que possam ser usados em diferentes refeições.\nDigite 'iniciar pesquisa' para começar!"
    },
    {
      "mensagens": [
        "suas receitas são complexas?",
        "as receitas são fáceis de fazer?",
        "preciso de algo rápido"
      ],
      "resposta": "Eu tenho uma variedade de receitas, desde algumas mais simples até outras um pouco mais elaboradas. O modo de preparo está detalhado em cada uma.Minha busca se concentra em encontrar receitas que contenham os ingredientes que você me fornece e/ou que não contenham os ingredientes que você quer evitar.\nDigite 'iniciar pesquisa' para começar!"
    }
  ]
}
